# Pandas
Built on top of NumPy

In [1]:
!pip3 install pandas upgrade
import pandas as pd
print(pd.__version__)

Requirement already satisfied: pandas in c:\users\being_aerys\appdata\local\programs\python\python36\lib\site-packages (0.24.2)

ERROR: Could not find a version that satisfies the requirement upgrade (from versions: none)
ERROR: No matching distribution found for upgrade
WARNING: You are using pip version 20.2.4; however, version 21.2.4 is available.
You should consider upgrading via the 'c:\users\being_aerys\appdata\local\programs\python\python36\python.exe -m pip install --upgrade pip' command.

0.24.2

## Creating Pandas Series
A 1D array capable of holding any data type.

#### Series with the default indexing

In [8]:
dummy_list = [1,2,3,4,5]
series = pd.Series(dummy_list)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

#### Series with custom indexing

In [9]:
dummy_list = [1,2,3,4,5]
series = pd.Series(dummy_list, index = ["a", "b", "c", "d", "e"])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

## Creating DataFrames

#### From HashMap
Specify value for each feature/column.
Optionally, can specify the index.

In [11]:
hashmap = {"feature1" : [5,6,5,3],
           "feature2" : [8,7,8,5],
           "feature3" : [8,5,6,3]}

indices = ["a", "b", "c", "d"]

df = pd.DataFrame(hashmap, index = indices)
df

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6
d         3         5         3

#### From 2D List
Specify value for each sample/row. Optionally, can specify the index. Optionally, can specify the column names.

In [14]:
two_dimen_array = [[1,2,3],
           [4,5,6],
           [7,8,9]]
indices = ["a", "b", "c"]
column_names = ["feat1", "feat2", "feat3"]

df = pd.DataFrame(two_dimen_array, index = indices, columns = column_names)
df

   feat1  feat2  feat3
a      1      2      3
b      4      5      6
c      7      8      9

#### Renaming or Creating Column Names

In [64]:
feature_names = ["f1", "f2", "f3"]
df.columns = feature_names
df

   f1  f2  f3
c   1   8   8
z   1   7   5
p   2   8   6
d   2   5   3
a   3   8   6
b   4   5   7

# Data Exploration

In [24]:
df.shape

(4, 3)

In [41]:
df.head(3)

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6

In [25]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [26]:
df.columns

Index(['feature1', 'feature2', 'feature3'], dtype='object')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
feature1    4 non-null int64
feature2    4 non-null int64
feature3    4 non-null int64
dtypes: int64(3)
memory usage: 288.0+ bytes

In [28]:
df.count()

feature1    4
feature2    4
feature3    4
dtype: int64

In [67]:
df["f1"].value_counts()

2    2
1    2
4    1
3    1
Name: f1, dtype: int64

In [70]:
df["f1"].unique()

array([1, 2, 3, 4], dtype=int64)

In [71]:
df["f1"].nunique()

4

In [29]:
df.sum()

feature1    19
feature2    28
feature3    22
dtype: int64

In [30]:
df.cumsum()

   feature1  feature2  feature3
a         5         8         8
b        11        15        13
c        16        23        19
d        19        28        22

In [31]:
df.min()

feature1    3
feature2    5
feature3    3
dtype: int64

In [32]:
df.max()

feature1    6
feature2    8
feature3    8
dtype: int64

In [33]:
df.describe()

       feature1  feature2  feature3
count  4.000000  4.000000  4.000000
mean   4.750000  7.000000  5.500000
std    1.258306  1.414214  2.081666
min    3.000000  5.000000  3.000000
25%    4.500000  6.500000  4.500000
50%    5.000000  7.500000  5.500000
75%    5.250000  8.000000  6.500000
max    6.000000  8.000000  8.000000

In [34]:
df.mean()

feature1    4.75
feature2    7.00
feature3    5.50
dtype: float64

In [35]:
df.median()

feature1    5.0
feature2    7.5
feature3    5.5
dtype: float64

# Input/ Output

### CSV

#### Read from CSV.
Optionally, defined the separator used in the csv file. If header not specified as None, the first row taken as column names.

In [19]:
dummy_csv = pd.read_csv("dummy_csv.csv", sep = ",", header = None)
dummy_csv

              0
0     9430875.0
1     9361062.5
2     9375000.0
3     9415687.5
4     9401562.5
5     9450000.0
6     9539687.5
7     9554562.5
8     9628750.0
9     9562500.0
10    9556375.0
11    9494562.5
12    9527875.0
13    9538187.5
14    9463000.0
15    9490250.0
16    9560937.5
17    9562125.0
18    9615250.0
19    9572000.0
20    9542250.0
21    9581250.0
22    9471812.5
23    9414312.5
24    9463062.5
25    9421500.0
26    9376375.0
27    9375000.0
28    8943812.5
29    8940875.0
...         ...
2693  8591187.5
2694  8572812.5
2695  8590562.5
2696  8867437.5
2697  8763500.0
2698  8741750.0
2699  8567312.5
2700  8529250.0
2701  8380437.5
2702  8601000.0
2703  8442250.0
2704  8584562.5
2705  8643750.0
2706  8587500.0
2707  8418750.0
2708  8342812.5
2709  8514875.0
2710  8586000.0
2711  8550000.0
2712  8541437.5
2713  8520250.0
2714  8531250.0
2715  8593937.5
2716  8625000.0
2717  8681250.0
2718  8663500.0
2719  8606562.5
2720  8524625.0
2721  8424500.0
2722  8485500.0

[2723 rows x 1 columns]

Can also read a certain number of samples instead of the whole csv.

In [20]:
dummy_csv = pd.read_csv("dummy_csv.csv", sep = ",", header = None, nrows = 10)
dummy_csv

           0
0  9430875.0
1  9361062.5
2  9375000.0
3  9415687.5
4  9401562.5
5  9450000.0
6  9539687.5
7  9554562.5
8  9628750.0
9  9562500.0

#### Write to CSV.

In [22]:
dummy_csv.to_csv("dummy_new.csv")

### Excel

#### Read from Excel.

In [35]:
# Add support for excel first.Install openyxl
!pip3 install openpyxl --upgrade

Requirement already up-to-date: openpyxl in c:\users\being_aerys\appdata\local\programs\python\python36\lib\site-packages (3.0.7)
Requirement already satisfied, skipping upgrade: et-xmlfile in c:\users\being_aerys\appdata\local\programs\python\python36\lib\site-packages (from openpyxl) (1.1.0)

WARNING: You are using pip version 20.2.4; however, version 21.2.4 is available.
You should consider upgrading via the 'c:\users\being_aerys\appdata\local\programs\python\python36\python.exe -m pip install --upgrade pip' command.

In [37]:
# set engine parameter to "openpyxl"
pd.read_excel("Geography.xlsx", engine = 'openpyxl')

XLRDError: Excel xlsx file; not supported

#### Read multiple sheets from the same Excel file.

In [ ]:
xslx = pd.ExcelFile("dummy.xls")
df = pd.read_excel(xlsx, "Sheet1")

#### Write to Excel.

In [ ]:
pd.to_excel("path/filename.xlsx", sheet_name = "Sheet1")

# Changing DataType in Pandas

In [106]:
dummy_dict = {"feature1" : [5,6,5,3],
           "feature2" : [8,7,8,5],
           "feature3" : [8,5,6,3]}

indices = ["a", "b", "c", "d"]

df = pd.DataFrame(dummy_dict, index = indices)
df

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6
d         3         5         3

#### Cast all columns of a dataframe into a different datatype.

In [112]:
df.dtypes

feature1    int64
feature2    int64
feature3    int64
dtype: object

In [113]:
df.astype("int32").dtypes

feature1    int32
feature2    int32
feature3    int32
dtype: object

In [114]:
df.dtypes

feature1    int64
feature2    int64
feature3    int64
dtype: object

#### Cast a single column to a different datatype.

In [115]:
df.astype({'feature1': 'int32'}).dtypes

feature1    int32
feature2    int64
feature3    int64
dtype: object

# Replace values in Pandas

#### Replace an occurence of a value in the whole data frame.

In [120]:
import pandas as pd
  
# Making data frame from the csv file
df = pd.read_csv("nba.csv")
  
# Printing the first 10 rows of the data frame for visualization
df[:10]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [123]:
df2 = df.replace(to_replace ="Boston Celtics", value ="Omega Warrior")
df2[:10]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Omega Warrior,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Omega Warrior,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Omega Warrior,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Omega Warrior,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Omega Warrior,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Omega Warrior,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Omega Warrior,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Omega Warrior,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Omega Warrior,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Omega Warrior,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

#### Replacing more than one value at a time. Using python list as an argument

In [125]:
df2 = df.replace(to_replace =["Boston Celtics", "Texas"], value ="Omega Warrior")
df2[:10]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Omega Warrior,0.0,PG,25.0,6-2,180.0,Omega Warrior,7730337.0
1,Jae Crowder,Omega Warrior,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Omega Warrior,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Omega Warrior,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Omega Warrior,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Omega Warrior,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Omega Warrior,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Omega Warrior,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Omega Warrior,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Omega Warrior,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

#### Replace each occurence of pattern/ regex in the Series/ index.

### Slicing

### Slicing a dataframe.

In [39]:
dummy_dict = {"feature1" : [5,6,5,3],
           "feature2" : [8,7,8,5],
           "feature3" : [8,5,6,3]}

indices = ["a", "b", "c", "d"]

df = pd.DataFrame(dummy_dict, index = indices)
df

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6
d         3         5         3

#### Using row number

#### Using column name.

#### Using row number and column name.

In [40]:
df.ix[0:2,"feature1"]

c:\users\being_aerys\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

a    5
b    6
Name: feature1, dtype: int64

#### Using Boolean Indexing

### Slicing a Series.

In [41]:
dummy_list = [1,2,3,4,5,6,7,8,9,0]
series = pd.Series(dummy_list)
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

In [42]:
series[series>5]

5    6
6    7
7    8
8    9
dtype: int64

# Dropping Records.

In [21]:
hashmap = {"feature1" : [5,6,5,3],
           "feature2" : [8,7,8,5],
           "feature3" : [8,5,6,3]}

indices = ["a", "b", "c", "d"]

df = pd.DataFrame(hashmap, index = indices)
df

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6
d         3         5         3

#### Drop rows.

In [22]:
df_new = df.drop(index = ["a","b"],axis = 0)
df_new

   feature1  feature2  feature3
c         5         8         6
d         3         5         3

#### Drop columns.

In [23]:
df2 = df.drop(["feature1","feature2"], axis = 1)
df2

   feature3
a         8
b         5
c         6
d         3

# Handling Missing Data

In [84]:
import numpy as np
data = {'f1':  [1,2,3,4,5,np.nan,6,7,np.nan,np.nan,8,9,10,np.nan],
        'f2': [11,12,np.nan,13,14,np.nan,15,16,np.nan,np.nan,17,np.nan,19,np.nan],
        'f3': [20,21,22,23,np.nan,24,np.nan,26,27,np.nan,np.nan,28,29,30]
       }
df = pd.DataFrame(data)
df

      f1    f2    f3
0    1.0  11.0  20.0
1    2.0  12.0  21.0
2    3.0   NaN  22.0
3    4.0  13.0  23.0
4    5.0  14.0   NaN
5    NaN   NaN  24.0
6    6.0  15.0   NaN
7    7.0  16.0  26.0
8    NaN   NaN  27.0
9    NaN   NaN   NaN
10   8.0  17.0   NaN
11   9.0   NaN  28.0
12  10.0  19.0  29.0
13   NaN   NaN  30.0

#### Drop any row with a NaN values

In [85]:
df.dropna()

      f1    f2    f3
0    1.0  11.0  20.0
1    2.0  12.0  21.0
3    4.0  13.0  23.0
7    7.0  16.0  26.0
12  10.0  19.0  29.0

#### Fill any NaN value with a specific value.

In [86]:
import numpy as np
data = {'f1':  [1,2,3,4,5,np.nan,6,7,np.nan,np.nan,8,9,10,np.nan],
        'f2': [11,12,np.nan,13,14,np.nan,15,16,np.nan,np.nan,17,np.nan,19,np.nan],
        'f3': [20,21,22,23,np.nan,24,np.nan,26,27,np.nan,np.nan,28,29,30]
       }
df = pd.DataFrame(data)
df

      f1    f2    f3
0    1.0  11.0  20.0
1    2.0  12.0  21.0
2    3.0   NaN  22.0
3    4.0  13.0  23.0
4    5.0  14.0   NaN
5    NaN   NaN  24.0
6    6.0  15.0   NaN
7    7.0  16.0  26.0
8    NaN   NaN  27.0
9    NaN   NaN   NaN
10   8.0  17.0   NaN
11   9.0   NaN  28.0
12  10.0  19.0  29.0
13   NaN   NaN  30.0

In [87]:
df.fillna(1)

      f1    f2    f3
0    1.0  11.0  20.0
1    2.0  12.0  21.0
2    3.0   1.0  22.0
3    4.0  13.0  23.0
4    5.0  14.0   1.0
5    1.0   1.0  24.0
6    6.0  15.0   1.0
7    7.0  16.0  26.0
8    1.0   1.0  27.0
9    1.0   1.0   1.0
10   8.0  17.0   1.0
11   9.0   1.0  28.0
12  10.0  19.0  29.0
13   1.0   1.0  30.0

# Add new rows/ columns.

In [101]:
hashmap = {"feature1" : [5,6,5,3],
           "feature2" : [8,7,8,5],
           "feature3" : [8,5,6,3]}

indices = ["a", "b", "c", "d"]

df = pd.DataFrame(hashmap, index = indices)
df

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6
d         3         5         3

#### Add a new row.

In [102]:
new_last_idx = len(df)
df.loc[new_last_idx] = [12,3,4] #notice loc instead of iloc
df

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6
d         3         5         3
4        12         3         4

#### Add new rows.

In [103]:
dummy = {"feature4" : [5,6,5,3],
           "feature5" : [8,7,8,5],
           "feature6" : [8,5,6,3]}

indices = ["y", "u", "t", "v"]

df2 = pd.DataFrame(hashmap, index = indices)
df2

   feature1  feature2  feature3
y         5         8         8
u         6         7         5
t         5         8         6
v         3         5         3

In [105]:
df = df.append(df2, ignore_index = False) # Notice that the feature names of the df to be appended does not matter.
df

   feature1  feature2  feature3
a         5         8         8
b         6         7         5
c         5         8         6
d         3         5         3
4        12         3         4
y         5         8         8
u         6         7         5
t         5         8         6
v         3         5         3
y         5         8         8
u         6         7         5
t         5         8         6
v         3         5         3

# Sorting in Pandas

In [44]:
hashmap = {"feature1" : [5,6,5,3],
           "feature2" : [8,7,8,5],
           "feature3" : [8,5,6,3]}

indices = ["c", "z", "p", "d"]

df = pd.DataFrame(hashmap, index = indices)
df

   feature1  feature2  feature3
c         5         8         8
z         6         7         5
p         5         8         6
d         3         5         3

#### Sort by Index
Note that index can be jumbled in a dataframe. So can sort these indices.
Optionally, can sort in a descending order of the index.

In [46]:
df.sort_index(ascending = False)

   feature1  feature2  feature3
z         6         7         5
p         5         8         6
d         3         5         3
c         5         8         8

#### Sort by Column
Instead of looking at the indices along axis 0, can look at other feature's value along the same axis 0.
Optionally, can choose to sort in a descending order of the particular feature.

In [48]:
df.sort_values(by = "feature2")

   feature1  feature2  feature3
d         3         5         3
z         6         7         5
c         5         8         8
p         5         8         6

# Grouping using GroupBy
A groupby operation involves some combination of splitting the dataframe and applying a function such as mean() to each of the groups, and combining the results.

In [57]:
hashmap = {"feature1" : [1,1,2,2,3,4],
           "feature2" : [8,7,8,5, 8, 5],
           "feature3" : [8,5,6,3,6,7]}

indices = ["c", "z", "p", "d", "a", "b"]

df = pd.DataFrame(hashmap, index = indices)
df

   feature1  feature2  feature3
c         1         8         8
z         1         7         5
p         2         8         6
d         2         5         3
a         3         8         6
b         4         5         7

In [58]:
df.groupby(["feature1"]) # returns a groupby object.

#### Find the mean of each feature within a group where each group is a distinct value of feature 1.

In [62]:
df.groupby(["feature1"]).mean()

          feature2  feature3
feature1
1              7.5       6.5
2              6.5       4.5
3              8.0       6.0
4              5.0       7.0

#### Find the mean of feature 2 within a group where each group is a distinct value of feature 1.

In [61]:
df.groupby(["feature1"])["feature2"].mean()

feature1
1    7.5
2    6.5
3    8.0
4    5.0
Name: feature2, dtype: float64

# Applying Functions in Pandas

In [36]:
func = lambda x: x*2

#### Elementwise function application

In [38]:
df.applymap(func)

   feature1  feature2  feature3
a        10        16        16
b        12        14        10
c        10        16        12
d         6        10         6

#### Along an axis.

In [40]:
def row_sum(row):
    return row.sum()

df.apply(row_sum, axis=1)

a    21
b    18
c    19
d    11
dtype: int64

# SQL with Pandas

In [2]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("flights.db")
df = pd.read_sql_query("select * from airlines limit 5;", conn)
df

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

#### Create SQL database from a database.
Creating a new database named sql_db.

In [7]:
df.to_sql("sql_db", conn)

Even though not displayed, we have just created a new database named sql_db. See below.

In [8]:
pd.read_sql_query("select * from sql_db limit 5;", conn)

,level_0,index,id,name,alias,iata,icao,callsign,country,active
0,0,0,1,Private flight,\N,-,None,None,None,Y
1,1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N